# LES REQUETES AVEC PYTHON 

## Préambule

- Créer un dossier nommé **Notes_DS**
- Dans ce dossier, copier et coller le fichier **notes_ds.csv**
- Lancer Thonny et créer un nouveau programme nommé **trait_donnees.py** que vous enregistrez dans la dossier **Notes_DS** 
- Dans ce fichier, vous allez écrire toutes les instructions données dasn ce fichier.

C'est à dire, toutes les phrases précédées de **Entrée [x] :**

On commence par importer la bibliothèque **pandas** et les données du fichier **notes_ds.csv** avec comme séparateur **la virgule  ","**

In [6]:
import pandas as pd

data = pd.read_csv("notes_ds.csv", sep=",")

On peut afficher le tableau (dans votre fichier ajouter **print(data)**)

In [16]:
data

        nom    prenom date_naissance  note_1  note_2  note_3
0    Franek  Baptiste     23/04/2004      12    11.0    13.5
1    Durant    Pierre     11/11/2005      17    14.5    13.0
2  Leporter    Alexia     13/09/2004       8    10.0    13.0
3     Franc    Noemie     22/08/2004      18    18.5    17.0
4   Wallyne      Cloe     03/01/2004       6     2.0     5.5
5      Zine    Ellias     18/04/2003      14     3.0     8.0

## Les requêtes

Faire une requête, c'est afficher une partie des données.

Par exemple:  les trois premières lignes ou les élèves qui ont eu une note supérieure à 10 ou encore afficher les notes d'un élève en particulier.

Pour faire une requête, on utilise la fonction **loc[ ]** et entre crochet, on écrit la requête.

Donc, pour afficher les trois premières lignes, on écrit:

In [11]:
data.loc[0:2]

        nom    prenom date_naissance  note_1  note_2  note_3
0    Franek  Baptiste     23/04/2004      12    11.0    13.5
1    Durant    Pierre     11/11/2005      17    14.5    13.0
2  Leporter    Alexia     13/09/2004       8    10.0    13.0

Changer le code précédent, pour afficher les lignes 2 à 4

On va afficher, tous les élèves qui ont eu la moyenne à la **note_1**

In [13]:
data.loc[data["note_1"]>=10]

      nom    prenom date_naissance  note_1  note_2  note_3
0  Franek  Baptiste     23/04/2004      12    11.0    13.5
1  Durant    Pierre     11/11/2005      17    14.5    13.0
3   Franc    Noemie     22/08/2004      18    18.5    17.0
5    Zine    Ellias     18/04/2003      14     3.0     8.0

Changer le code précédent, pour afficher tous les élèves qui ont eu une note supérieure à 14 pour la note_2

On peut faire des calculs sur le tableau obtenu par la requête.

On peut calculer la moyenne des élèves qui ont ey une note supérieurs à 10 à la note_1:

In [14]:
data.loc[data["note_1"]>=10].mean()

note_1    15.250
note_2    11.750
note_3    12.875
dtype: float64

On peut afficher de Leporter Alexia:

In [20]:
data.loc[data["nom"]=="Leporter"]

        nom  prenom date_naissance  note_1  note_2  note_3
2  Leporter  Alexia     13/09/2004       8    10.0    13.0